{
    "about": {
        "text": "Hi, I'm a passionate game developer with experience in creating immersive experiences and technical art."
    },
    "projects": [
        {
            "ID": "001",
            "title": "Imp Hunter",
            "description": "Imp Hunter is a physics-based shooting game where the player controls a cannon to fend off waves of attacking imps, with the core mechanics heavily relying on vector-based calculations. The movement of the cannon, projectile trajectories, and imp behavior are all governed by these calculations, ensuring smooth and precise gameplay. Aiming the cannon involves real-time vector computations to translate player input into accurate, fluid movements. When fired, cannonballs follow realistic trajectories, with their bounce and ricochet off surfaces determined by vectors that calculate angles, velocity, and impact forces. This adds strategic depth, as players must anticipate how projectiles will behave after impact to maximize their effectiveness. Similarly, the imps' movement is not random; their paths, speed, and direction are calculated relative to the player, requiring adaptation and strategy. These vector-based computations create an immersive experience, where mastering the game's physics is key to success, offering a rewarding challenge for players who enjoy skill-based, mathematically-driven gameplay.",
            "image": "images/projects/ImpHunter/ImpHunterImage.png",
            "color": "#d24a4a",
            "timeline": "Year 1 - Simulation and Physics",
            "engine": "MonoGame",
            "language": ["C#"],
            "programs": ["Visual Studio", "Adobe Photoshop", "Aseprite", "MonoGame Framework"],
            "team_size": 1,
            "role": ["Solo Developer"],
            "link": "https://github.com/kianniek/Imp-Hunter"
        },
        {
            "ID": "002",
            "title": "Mountain Climbers",
            "description": "Mountain Climbers is a couch co-op platformer inspired by the classic Nintendo game Ice Climbers, where players must work together to explore the game world. In this cooperative adventure, teamwork is essential, as players use ropes and each other to overcome obstacles and reach new areas. The game's design emphasizes collaboration, requiring players to coordinate their actions, whether by helping each other climb or solving puzzles together. With its focus on cooperative mechanics, Mountain Climbers offers a unique and engaging experience, challenging players to communicate and strategize to progress through the levels.",
            "image": "images/projects/Mountain Climbers/MainMenu.png",
            "color": "#ec9235",
            "role": ["Lead Developer", "Designer", "Project Manager"],
            "team_size": 4,
            "timeline": "Year 1 - Project Agile Game Development",
            "engine": "MonoGame",
            "language": ["C#"],
            "programs": ["Visual Studio", "Adobe Photoshop", "Aseprite", "MonoGame Framework"],
            "github": "https://github.com/kianniek/Mountain-Climbers"
        },
        {
            "ID": "003",
            "title": "Tiles Of Chick Island",
            "description": "The game showcases three distinct search algorithms for terrain traversal, each designed to demonstrate different approaches to navigating complex environments. These algorithms offer varying methods of finding optimal paths across terrain, highlighting the strengths and weaknesses of each. By implementing multiple algorithms, the game provides a deeper understanding of search mechanics, allowing players or users to observe how different strategies handle challenges like obstacles, varying terrain types, and efficiency in reaching a destination. This comparison not only adds educational value but also enhances the game's strategic depth, giving insight into algorithmic decision-making processes.",
            "image": "images/projects/TilesOfChickIsland/Tiles_of_Chick_Island_o2HKW3PPOa.png",
            "color": "#c7e5fc",
            "disclaimers": "Important to note that this project was not made by me, but I studied the inner workings to understand it fully and recreate it in any other game/3D application.",
            "timeline": "Year 2 - Artificial Intelligence",
            "engine": "Unity",
            "language": ["C#"],
            "programs": ["Adobe Photoshop", "Blender"],
            "team_size": 1,
            "role": ["Researcher"],
            "github": "https://github.com/kianniek/tiles-of-chick-island"
        },
        {
            "ID": "004",
            "title": "The Flocking Dead",
            "description": "The game showcases flocking behavior, a simulation of how groups of entities, such as birds or animals, move cohesively as a unit. This behavior is driven by algorithms that mimic real-world dynamics, where individuals follow simple rules like alignment, cohesion, and separation to create complex, collective movement patterns. By integrating flocking behavior, the game demonstrates how emergent behaviors arise from simple interactions, offering players an opportunity to observe realistic group dynamics in motion. This feature not only enhances the game's realism but also provides insight into the principles of artificial intelligence and behavior modeling.",
            "image": "images/projects/TheFlockingDeath/The_Flocking_Dead_1 (2).png",
            "color": "#d4bf95",
            "disclaimers": "Important to note that this project was not made by me, but I studied the inner workings to understand it fully and recreate it in any other game/3D application.",
            "timeline": "Year 2 - Artificial Intelligence",
            "engine": "Unity",
            "language": ["C#"],
            "programs": ["Aseprite"],
            "team_size": 1,
            "role": ["Researcher"],
            "github": "https://github.com/kianniek/the-flocking-dead-AI"
        },
        {
            "ID": "005",
            "title": "20 Questions",
            "description": "The game is a replication of the popular 20 Questions game, utilizing tree traversal algorithms to simulate the process of narrowing down answers. In this version, the game systematically traverses a decision tree, asking yes or no questions to identify an unknown object or concept. Each question corresponds to a node in the tree, and depending on the player's response, the game moves to different branches, eventually leading to the correct answer. By employing tree traversal techniques, this version of 20 Questions not only mimics the original gameplay but also illustrates the practical application of data structures in decision-making processes.",
            "image": "images/projects/20Questions/20QuestionsImage.png",
            "color": "#b7a5da",
            "disclaimers": "Important to note that this project was not made by me, but I studied the inner workings to understand it fully and recreate it in any other game/3D application.",
            "timeline": "Year 2 - Artificial Intelligence",
            "engine": "Unity",
            "language": ["C#"],
            "programs": ["Aseprite"],
            "team_size": 1,
            "role": ["Researcher"],
            "github": "https://github.com/kianniek/Treespire"
        },
        {
            "ID": "006",
            "title": "Cloud Workers",
            "description": "In this game, you control a ship that uses clouds as fuel to stay airborne, while enemy pirate ships attempt to take you down. To defend yourself, you can shoot rockets to destroy the attacking pirates, but there's a critical trade-off: firing rockets consumes your cloud-based fuel. This creates a strategic challenge where you must balance collecting fuel from the clouds to keep flying while defending yourself from pirate attacks. The key to achieving a high score lies in managing your fuel efficiently while maintaining an effective defense against the enemies.",
            "image": "images/projects/CloudWorkers/TitleCloudWorkers.png",
            "color": "#120FFF",
            "timeline": "Year 2 - Game Mechanics",
            "engine": "Unity",
            "language": ["C#", "ShaderLab"],
            "programs": ["Blender"],
            "team_size": 1,
            "role": ["Solo Developer"],
            "github": "https://github.com/kianniek/Cloud-Workers"
        },
        {
            "ID": "007",
            "title": "The Light (At the End of the Tunnel)",
            "description": "This platformer is set in a sewer, where the objective is to reach the light at the end of the tunnel and replace a broken bulb. The game consists of five distinct levels, each presenting unique challenges: *Sinking Area*, where the environment is gradually submerged; *Flip Swap Level*, which involves alternating platforms; *Air Pipe Part*, focused on navigating air currents; *Rotating Puzzle*, a level filled with spinning mechanisms to solve; and *The Speedrun Rotation*, a fast-paced challenge testing the player's agility. Each level offers a different gameplay experience, requiring skill and strategy to complete.",
            "image": "images/projects/TheLight/TheLightAtTheEnd.jpg",
            "color": "#FF6633",
            "role": ["Lead Developer", "Designer", "Project Manager"],
            "team_size": 4,
            "timeline": "Year 2 - Project Game Development",
            "engine": "Unity",
            "language": ["C#", "ShaderLab"],
            "programs": ["Adobe Photoshop", "Blender"],
            "github": "https://github.com/kianniek/The-Light-At-the-end-of-the-tunnel"
        },
        {
            "ID": "008",
            "title": "Chorís Ánchos",
            "description": "This VR application is designed as a relaxation and meditation tool for students and teachers at Xplore - Angora High School. It allows users to explore a variety of immersive worlds, each crafted to promote relaxation and stress relief. The environments are carefully designed to help users unwind, offering a calming experience ideal for taking a break from the demands of school life. The application aims to provide a therapeutic escape, enabling both students and teachers to de-stress and rejuvenate through the soothing, virtual landscapes.",
            "role": ["Developer", "Designer"],
            "team_size": 4,
            "image": "images/projects/Chorís Ánchos/MoodBoardConseptLogo.jpg",
            "color": "#FFFFFF",
            "credits": "Developed for Xplore - Angora Amsterdam during the Virtual Reality semester.",
            "timeline": "Thematic Semester - Virtual Reality",
            "engine": "Unity",
            "language": ["C#", "HLSL", "GLSL", "Compute Shaders"],
            "programs": ["Adobe Photoshop", "Blender", "Unity XR Toolkit"],
            "github": "https://github.com/kianniek/Agora-VR-Project"
        },
        {
            "ID": "009",
            "title": "Procedurally Generated Walls and Pathways",
            "description": "This research and development project focused on the procedural generation of 'brick' stone walls and pathways, utilizing advanced techniques such as spline generation, shaders, and flood fill algorithms. Spline generation was employed to create smooth, customizable paths, while shaders were used to render realistic textures and lighting for the stone surfaces. The flood fill algorithm ensured that the procedural generation filled spaces efficiently and accurately, creating natural-looking structures. The project aimed to develop methods for dynamically generating intricate architectural elements, providing a foundation for more automated and realistic environment creation in games and simulations.",
            "link": "https://summit-2324-sem2.game-lab.nl/2024/02/28/procedualy-generated-walls-and-pathways/",
            "image": "images/projects/ProcedualWalls/LogoOfProject.png",
            "color": "#50aa50",
            "timeline": "Thematic Semester - Gameplay engineering",
            "engine": "Unity",
            "language": ["C#", "HLSL", "Compute Shaders"],
            "programs": ["Blender"],
            "team_size": 1,
            "role": ["Solo Developer"],
            "github": "https://github.com/kianniek/ProcedualWallsAndPaths"
        },
        {
            "ID": "010",
            "title": "Function Dungeon II",
            "description": "Function-Dungeon-II is an educational game created to help students aged 12 to 16 learn and practice linear functions in an engaging and interactive way. The game is designed to combine learning with entertainment, providing students with a hands-on approach to understanding mathematical concepts through gameplay. My team and I developed a prototype to explore this design space, focusing on making complex topics like linear functions more accessible and enjoyable for students. The goal of the project is to create a learning experience that enhances students' understanding while maintaining their interest and motivation.",
            "role": ["Lead Developer"],
            "team_size": 8,
            "image": "images/projects/Function-Dungeon-II/Combined Images.png",
            "color": "#12455F",
            "credits": "Developed for the Smart Education Lab at the Applied University of Sciences Amsterdam (AUSA).",
            "timeline": "Thematic Semester - Gameplay engineering",
            "engine": "Unity",
            "language": ["C#"],
            "programs": [],
            "github": "https://github.com/kianniek/Function-Dungeon-II"
        },
        {
            "ID": "011",
            "title": "Context Medium Change App",
            "description": "An app concept designed to help visually impaired individuals be more independent by using computer vision and AI technologies like image recognition, object classification, and contextual feedback.",
            "role": "Prototype Developer, Designer",
            "team_size": 4,
            "image": "Insert Image URL",
            "color": "Insert Color",
            "credits": "Developed during the minor 'Design for Emerging Technologies'.",
            "timeline": "Minor - Design for Emerging Technologies",
            "engine": "",
            "language": "",
            "programs": [],
            "github": "https://github.com/kianniek/Manual-AI-module"
        },
        {
            "ID": "012",
            "title": "Internet of Things Project",
            "description": "",
            "role": "Prototype Developer, Designer",
            "image": "Insert Image URL",
            "color": "Insert Color",
            "credits": "Developed during the minor 'Design for Emerging Technologies'.",
            "timeline": "Minor - Design for Emerging Technologies",
            "engine": "",
            "language": "",
            "programs": [],
            "team_size": 1,
            "github": "https://github.com/kianniek/NodeMCU-via-Telegram"
        }
    ],
    "contact": {
        "text": "Feel free to reach out at kianniek@hotmail.com for any inquiries or collaborations."
    }
}
